{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "Moe_behavior_only": false,
  "moe_intermediate_size": 512,
  "behavior_injection": false,
  "behavior_embedding_dim": 128,
  "sparse_layers_decoder": [],
  "behavior_injection_decoder": [],
  "cross_attention_decoder": [],
  "dropout_rate": 0.10,
  "attention_bias": false,
  "attention_dropout": 0.10,
  "bos_token_id": 4,
  "pad_token_id": 4,
  "eos_token_id": 8,
  "hidden_act": "silu", 
  "head_dim": 96,
  "hidden_size": 512,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 8,
  "num_hidden_layers": 4,
  "num_key_value_heads": 2,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 8.0,
    "low_freq_factor": 1.0,
    "high_freq_factor": 4.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.42.3",
  "use_cache": true,
  "vocab_size": 14
}
